app/controllers/reviews_controller.rb

  def index
    @reviews = Review.order(created_at: :desc)
---
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("title", "review_content", "created_at", "updated_at", "review_image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test3"], ["review_content", "test"], ["created_at", "2024-08-16 11:19:54.803520"], ["updated_at", "2024-08-16 11:19:54.803520"], ["review_image", "a24.jpeg"]]

  def destroy
    review = Review.find_by(id: params[:id])
    review.destroy!
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]